//version 1.0.0+1

class Constants {
  static const String introduction = 'مقدمة';

  static const String introductionDetails =
      'مرحباً بك مع برنامج مواعيد تمديدات الحبس الإحتياطي , دقة سهولة أمان '
      'بالإضافة الى سهولة الاستخدام , يوفر هذا البرنامج : \n'
      'انه يمكنك إضافة المتهم وسيتم تنفيذ الإجراءات اللازمة لإدارة التنبيهات وتترتب التنبيهات كالتالي:   \n'
      '- سيتم تنبيهك بعد اسبوع من تاريخ إضافتك للمتهم وهذا يسمى بالتنبية الاول. \n'
      '- بعد مرور الاسبوع الاول سيتم تنبيهك بعد خمسة وأربعون يوماً,وهذا يسمى بالتنبية الثاني . \n'
      ' - بعد ذلك سيتم ايضاً سوف ينبهك مرة أخرى بعد خمسة وأربعون يوماً,وهذا يسمى بالتنبية الثالث وهذا يعتبر التنبية الأخير لنتهاء التهمه بشكل كُلي . \n';

  static const String privacy = 'الخصوصية';

  static const String privacyDetails =
      '- يتطلب مواعيد تمديدات الحبس الإحتياطي الوصول الى ملفات الجهاز لقراءة وكتابة بعض الاشياء مثل ملفات ال pdf. \n'
      ' - يتطلب مواعيد تمديدات الحبس الإحتياطي الوصول الى حسابك في جوجل درايف لأخذ نسخة احتياطية من بياناتك الى حسابك في جوجل درايف. \n';

  static const String defendantSettings = 'إعدادات المتهم';

  static const String defendantSettingsDetails = '- يمكنك إضافة متهم. \n'
      '- يمكنك تعديل بيانات المتهم. \n'
      '- يمكنك إنهاء تهمة المتهم. \n '
      '- يمكنك حذف المتهم.  \n ';

  static const String search = 'بحث - فلترة - ترتيب';
  static const String searchDetails = '- يمكنك بسهولة البحث عن متهم معين. \n'
      '- يمكنك تفلتر البيانات حسب الذي تم اضافته  \n[لهذا اليوم - الاسبوع - الشهر - العام - الكل]. \n'
      '- يمكنك ترتيب البيانات حسب رقم القضية. \n'
      '* يمكنك ترتيب البيانات : \n'
      '- ترتيب تصاعدي(أ-ي) . \n'
      '-على وشك الانتهاء . \n'
      '-المضاف مؤخراً. \n'
      '-منتهي.  \n';

  static const String shire = 'مشاركة';
  static const String shireDetails =
      'يمكنك مشاركة بيانات المتهم مع اي شخص آخر بصيغة بي دي اف (pdf) . \n';

  static const String security = 'الحماية';
  static const String securityDetails =
      'يوفر مواعيد تمديدات الحبس الإحتياطي الحماية لدخول التطبيق عبر بصمة إصبعك او الماسح الضوئي للعين من اجل حماية بياناتك من التغيير من قِبل شخص آخر . ';

  static const String alertsManagement = 'إدارة التنبيهات';
  static const String alertsManagementDetails =
      'يمكنك التحكم في وقت النتبية مثلاً إيقاف التنبية الاول او الثاني او الثالث وما الى ذالك.';
  static const String communicationAndSupport = 'الاتصال والدعم';
  static const String communicationAndSupportDetails =
      '-الجوال:773228315 967+\n'
      ' - البريد الالكتروني:   \n najeebaslan2019@gmail.com\n'
      'نحن ايظاً نتواجد على الواتس اب ونستمع الى مقترحاتكم ,'
      'شكراً لستخدامكم مواعيد تمديدات الحبس الإحتياطي.\n';
}
